tap 'homebrew/cask'

brew 'coreutils'
brew 'openssl'
brew 'git'
brew 'gcc'
brew 'mackup'
brew 'mas'
brew 'tmux'
brew 'node'
brew 'python'
brew 'pipenv'
# brew install kubectl
# brew install doctl
brew install pulumi

# autossh
brew 'autossh'

# ripgrep
brew 'ripgrep'

# https://github.com/sharkdp/bat
brew 'bat'

# Apps
# https://github.com/driesvints/dotfiles/blob/main/Brewfile
brew 'toggl-track'
cask 'cryptomator'
cask 'alfred'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'imageoptim'
cask 'postman'
cask 'skype'
cask 'sublime-text'
cask 'postico'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'
cask 'spotify'
cask 'app-cleaner'
cask 'folx'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboardcleantool'
cask 'ngrok'
cask 'notion'
cask 'rocket'
cask 'runjs'
cask 'signal'
cask 'sourcetree'
cask 'teamviewer'
cask 'textbar'
cask 'vanilla'
cask 'zoomus'
cask 'expressvpn'
brew install --cask local

cask 'postgres'
cask 'redis'


declare -a mas_apps=(
  '918858936'   # Airmail 4
  '441258766'   # Magnet
  '1333542190'  # 1Password
  '1351639930'  # Gifski
  '425424353'   # The Unarchiver
  '409183694'   # Keynote
)

for app in "${mas_apps[@]}"; do
  mas install "$app"
done
